



function burgerMenu() {
  const iconMenu = document.querySelector('.icon-menu')
  const menuBody = document.querySelector('.menu__body')
  const links = document.querySelectorAll('.menu__list li')

  function toggleMenu() {
    menuBody.classList.toggle("_active");
    iconMenu.classList.toggle('_active');
    // document.body.classList.add('_lock');
  }
  iconMenu.addEventListener("click", (e) => {
    toggleMenu()
  })
  links.forEach.call(links, function (el) {
    el.addEventListener("click", () => toggleMenu());
  });
}

burgerMenu();

console.log('%cСамопроверка задания:', 'color: #fecb00; font-weight: 700')
console.log(`
- [x] вёрстка валидная ("Document checking completed. No errors or warnings to show.") [10/10]
- [x] вёрстка семантическая [h1 (1 на странице), h2, h3, h4, header, nav, figure, main, section, footer] [20/20]
- [x] для оформления СV используются css-стили (более 10 стилизованных элементов) [10/10]
- [x] контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, если он есть, тянется во всю ширину страницы [10/10]
- [x] вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется [10/10]
- [x] есть меню. Ссылки в пунктах меню ведут на основные разделы CV. При кликах по пунктам меню реализована плавная прокрутка по якорям. При уменьшении ширины экрана меню становится адаптивным (10/10)
- [x] на странице СV присутствует изображение - фото автора CV, пропорции изображения не искажены, у изображения есть атрибут alt (может быть пустым) (10/10)
- [x] контакты для связи и перечень навыков оформлены в виде списка ul > li [10/10]
- [x] CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского [10/10]
- [x] CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода [10/10]
- [x] CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница проекта открывается в новой вкладке [10/10]
- [x] CV выполнено на английском языке [10/10]
- [x] выполнены требования к Pull Request [10/10]
- [x] есть видеорезюме автора CV на английском языке. Продолжительность видео 3-5 минут (±15 секунд). В описание видео на YouTube добавлена его транскрипция на английском языке [10/10]
- [x] качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию (это дополнительные 10 баллов, поэтому некоторый субъективизм в оценке может присутствовать) [10/10]`)
console.log('%cИтого: ', 'color: #fecb00; font-weight: 700', '160/160')
console.log('%cМаксимальная оценка 150', 'color: #fecb00; font-weight: 700')